[
  {
    "bookId": "001",
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://m.media-amazon.com/images/I/71V1cA2fiZL._SL1500_.jpg",
    "review": "The Great Gatsby is a classic novel by F. Scott Fitzgerald, set in the roaring twenties, a time of prosperity and excess. The story revolves around the mysterious Jay Gatsby and his love for the enchanting Daisy Buchanan. Through vivid descriptions and rich character development, Fitzgerald paints a vivid picture of the Jazz Age and its moral decay. Themes of love, wealth, and the American Dream are explored with depth and nuance, making The Great Gatsby a timeless masterpiece.",
    "totalPages": 180,
    "rating": 4.2,
    "category": "Fiction",
    "tags": ["Romance", "Tragedy"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "bookId": "002",
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://m.media-amazon.com/images/I/81aY1lxk+9L._SL1500_.jpg",
    "review": "To Kill a Mockingbird by Harper Lee is a powerful story that tackles complex themes such as racial injustice, morality, and childhood innocence. Set in the fictional town of Maycomb, Alabama, during the 1930s, the novel follows Scout Finch, her brother Jem, and their father Atticus, a lawyer who defends a black man falsely accused of raping a white woman. Through Scout's eyes, we witness the harsh realities of racism and prejudice, as well as the courage and compassion of those who fight against it. Lee's masterful storytelling and memorable characters make To Kill a Mockingbird a timeless classic that continues to resonate with readers of all ages.",
    "totalPages": 281,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Social Issues", "Coming of Age"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": "003",
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://m.media-amazon.com/images/I/71rpa1-kyvL._SL1500_.jpg",
    "review": "1984 by George Orwell is a dystopian novel that presents a chilling vision of a future totalitarian society. Set in the year 1984, the story follows Winston Smith, a low-ranking member of the ruling Party in London, as he grapples with oppression, surveillance, and thought control. Through Winston's journey, Orwell explores themes of power, propaganda, and the erosion of individual freedom. 1984 is a haunting warning against the dangers of authoritarianism and the importance of preserving truth and liberty.",
    "totalPages": 328,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Political Satire", "Philosophical"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": "004",
    "bookName": "The Catcher in the Rye",
    "author": "J. D. Salinger",
    "image": "https://m.media-amazon.com/images/I/71nXPGovoTL._SL1500_.jpg",
    "review": "The Catcher in the Rye by J.D. Salinger is a coming-of-age novel that follows the experiences of Holden Caulfield, a disillusioned teenager navigating the complexities of adolescence and adulthood. Through Holden's unique voice and perspective, Salinger captures the confusion, alienation, and longing for connection that define the teenage experience. The novel explores themes of identity, innocence, and the search for meaning in a world that often seems indifferent and phony. With its iconic protagonist and timeless insights, The Catcher in the Rye continues to resonate with readers of all generations.",
    "totalPages": 277,
    "rating": 4.1,
    "category": "Fiction",
    "tags": ["Alienation", "Cultural Critique"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": "005",
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://m.media-amazon.com/images/I/81NLDvyAHrL._SL1500_.jpg",
    "review": "Pride and Prejudice by Jane Austen is a timeless romance that follows the spirited Elizabeth Bennet as she navigates the complexities of love, class, and society in 19th-century England. Through witty dialogue and astute observations, Austen explores themes of prejudice, family, and the search for true happiness. The novel's memorable characters and sparkling prose have made it a beloved classic that continues to enchant readers of all ages.",
    "totalPages": 279,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Romance", "Satire"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": "006",
    "bookName": "Moby-Dick",
    "author": "Herman Melville",
    "image": "https://m.media-amazon.com/images/I/71d5wo+-MuL._SL1500_.jpg",
    "review": "Moby-Dick by Herman Melville is a literary masterpiece that explores themes of obsession, fate, and the mysteries of the sea. The novel follows the journey of Ishmael, a sailor on a whaling ship, as he joins Captain Ahab on his quest for revenge against the elusive white whale, Moby Dick. Through vivid descriptions and philosophical musings, Melville delves into the depths of the human psyche, exploring the destructive power of unchecked ambition and the nature of existence itself. Moby-Dick is a sprawling epic that continues to captivate readers with its rich symbolism and timeless relevance.",
    "totalPages": 623,
    "rating": 4.0,
    "category": "Fiction",
    "tags": ["Adventure", "Symbolism"],
    "publisher": "Richard Bentley (UK); Harper & Brothers (US)",
    "yearOfPublishing": 1851
  },
  {
    "bookId": "007",
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://m.media-amazon.com/images/I/71UZKQ3-wCL._SL1500_.jpg",
    "review": "The Hobbit by J.R.R. Tolkien is a delightful fantasy adventure that follows the journey of Bilbo Baggins, a hobbit who is swept away on a quest to reclaim a lost treasure guarded by the dragon Smaug. Along the way, Bilbo encounters trolls, elves, and goblins, and discovers courage and resourcefulness he never knew he had. Tolkien's richly imagined world and captivating storytelling make The Hobbit an enduring classic beloved by readers of all ages.",
    "totalPages": 310,
    "rating": 4.6,
    "category": "Fantasy",
    "tags": ["Adventure", "Magic"],
    "publisher": "Allen & Unwin (UK)",
    "yearOfPublishing": 1937
  },
  {
    "bookId": "008",
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://m.media-amazon.com/images/I/81FPzmB5fgL._SL1500_.jpg",
    "review": "The Alchemist by Paulo Coelho is a transformative journey of self-discovery and personal legend. The novel follows Santiago, a young shepherd who embarks on a quest to find his treasure and fulfill his destiny. Along the way, he encounters a series of mentors and learns valuable lessons about love, courage, and the power of dreams. Coelho's lyrical prose and philosophical insights make The Alchemist a timeless tale of inspiration and empowerment.",
    "totalPages": 197,
    "rating": 4.2,
    "category": "Fiction",
    "tags": ["Philosophical", "Journey"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "bookId": "009",
    "bookName": "The Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "image": "https://m.media-amazon.com/images/I/81nV6x2ey4L._SL1500_.jpg",
    "review": "The Lord of the Rings by J.R.R. Tolkien is an epic fantasy trilogy that transports readers to the enchanting world of Middle-earth. The story follows Frodo Baggins, a humble hobbit, as he embarks on a perilous journey to destroy the One Ring and defeat the dark lord Sauron. Along the way, Frodo is joined by a fellowship of diverse characters, each with their own strengths and weaknesses. Tolkien's richly detailed world-building and masterful storytelling make The Lord of the Rings an enduring classic that continues to captivate readers of all generations.",
    "totalPages": 1178,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Adventure", "Magic"],
    "publisher": "Allen & Unwin (UK)",
    "yearOfPublishing": 1954
  },
  {
    "bookId": "010",
    "bookName": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "image": "https://m.media-amazon.com/images/I/A1jGvzIZ7ZL._SL1500_.jpg",
    "review": "Harry Potter and the Sorcerer's Stone by J.K. Rowling is a magical adventure that introduces readers to the enchanting world of Hogwarts School of Witchcraft and Wizardry. The story follows Harry Potter, a young orphan who discovers he is a wizard on his eleventh birthday and embarks on a journey of self-discovery, friendship, and courage. With its richly imagined world, memorable characters, and gripping plot, Harry Potter and the Sorcerer's Stone is a captivating start to one of the most beloved series in modern literature.",
    "totalPages": 309,
    "rating": 4.7,
    "category": "Fantasy",
    "tags": ["Magic", "Adventure"],
    "publisher": "Bloomsbury Publishing (UK)",
    "yearOfPublishing": 1997
  },
  {
    "bookId": "011",
    "bookName": "The Night Circus",
    "author": "Erin Morgenstern",
    "image": "https://m.media-amazon.com/images/I/71+whvJjE3L._SL1500_.jpg",
    "review": "The Night Circus by Erin Morgenstern is a captivating tale of magic, love, and intrigue set in a mysterious circus that appears without warning and is only open at night. Within its black and white tents, visitors are enchanted by extraordinary performances and enchanted wonders, unaware of the fierce competition brewing between two young illusionists, Celia and Marco, who are bound by a dangerous game orchestrated by their mentors. As their rivalry intensifies, so does their forbidden love, threatening to unravel the very fabric of the circus itself. Morgenstern's lyrical prose and imaginative storytelling create a mesmerizing world that will leave readers spellbound.",
    "totalPages": 387,
    "rating": 4.4,
    "category": "Fantasy",
    "tags": ["Magic", "Mystery"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2011
  },
  {
    "bookId": "012",
    "bookName": "Educated",
    "author": "Tara Westover",
    "image": "https://m.media-amazon.com/images/I/71KCV+h6tzL._SL1500_.jpg",
    "review": "Educated by Tara Westover is a powerful memoir that recounts the author's journey from growing up in a strict and isolated household in rural Idaho to pursuing higher education against all odds. Despite never attending school, Westover's thirst for knowledge leads her to teach herself and eventually gain admission to prestigious universities. Along the way, she grapples with the complexities of family loyalty, identity, and the pursuit of truth. Through her resilience and determination, Westover sheds light on the transformative power of education and the importance of forging one's own path. Educated is an inspiring story of self-discovery and triumph over adversity.",
    "totalPages": 334,
    "rating": 4.6,
    "category": "Memoir",
    "tags": ["Education", "Family"],
    "publisher": "Random House",
    "yearOfPublishing": 2018
  }
]
